docs/comp-sci/sml/idioms.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Idioms - SML</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Idioms - SML</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-151fd75d-61bd-4eb2-b962-3724940c7e31">1. Using <code>type t</code> in Signatures</a></li>
<li><a href="#h-b1168d9b-0e58-41f4-9bcc-53e5d2775d08">2. Datatypes in Signatures</a></li>
<li><a href="#h-5e1f48c1-d6ff-4e40-bcc4-08564a1aa48d">3. Stringify Types</a>
<ul>
<li><a href="#h-889254de-0316-4e44-9331-d92d371b8419">3.1. Type Conversions</a></li>
</ul>
</li>
<li><a href="#h-770611ec-d37f-42e9-9e97-802a79d389be">4. Comparable Types</a>
<ul>
<li><a href="#h-bb3e2d02-6651-49d4-82bb-11083bfa0fb5">4.1. Caveat: Equality Testing</a></li>
</ul>
</li>
<li><a href="#h-20417263-b75c-464c-b4ef-e48078110bd6">5. Principle: Similar Functions should have Similar Names</a></li>
</ul>
</div>
</div>
<p>
These are idioms gleaned from reading some random Standard ML programs.
</p>
<div id="outline-container-h-151fd75d-61bd-4eb2-b962-3724940c7e31" class="outline-2">
<h2 id="h-151fd75d-61bd-4eb2-b962-3724940c7e31"><span class="section-number-2">1.</span> Using <code>type t</code> in Signatures</h2>
<div class="outline-text-2" id="text-h-151fd75d-61bd-4eb2-b962-3724940c7e31">
<p>
When encoding a data type as a signature, for example a <code>signature SET</code>,
use <code>type t</code> to specify the data type.
</p>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">signature</span> <span class="org-interface-def">SET</span> =
<span class="org-keyword">sig</span>
    <span class="org-keyword">type</span> 'a <span class="org-type-def">t</span>;
    <span class="org-keyword">val</span> <span class="org-variable-name">empty</span> : 'a t;
    <span class="org-keyword">val</span> <span class="org-variable-name">insert</span> : 'a -&gt; 'a t -&gt; 'a t;
    <span class="org-keyword">val</span> <span class="org-variable-name">null</span> : 'a t -&gt; bool;
    <span class="org-keyword">val</span> <span class="org-variable-name">member</span> : 'a -&gt; 'a t -&gt; bool;
    <span class="org-keyword">val</span> <span class="org-variable-name">map</span> : ('a -&gt; 'b) -&gt; 'a t -&gt; 'b t;
<span class="org-keyword">end</span>;

<span class="org-keyword">structure</span> <span class="org-module-def">TreeSet</span> : SET =
<span class="org-keyword">struct</span>
    <span class="org-keyword">datatype</span> 'a <span class="org-type-def">t</span> = E | T <span class="org-keyword">of</span> int*'a*('a t)*('a t);

    <span class="org-keyword">val</span> <span class="org-variable-name">empty</span> = E;

    <span class="org-keyword">fun</span> <span class="org-function-name">insert</span> x E = <span class="org-comment-delimiter">(* </span><span class="org-comment">...</span><span class="org-comment-delimiter"> *)</span>
      | insert x (T (n, v, l, r)) = <span class="org-comment-delimiter">(* </span><span class="org-comment">...</span><span class="org-comment-delimiter"> *)</span>;

    <span class="org-keyword">fun</span> <span class="org-function-name">null</span> E = true
      | null _ = false;

    <span class="org-keyword">fun</span> <span class="org-function-name">member</span> _ E = false
      | x (T (_, v, l, r)) = <span class="org-comment-delimiter">(* </span><span class="org-comment">...</span><span class="org-comment-delimiter"> *)</span>;

    <span class="org-keyword">fun</span> <span class="org-function-name">map</span> _ E = E
      | map f (T (_, x, l, r)) = <span class="org-comment-delimiter">(* </span><span class="org-comment">...</span><span class="org-comment-delimiter"> *)</span>;
<span class="org-keyword">end</span>;

<span class="org-comment-delimiter">(* </span><span class="org-comment">mySet : TreeSet.t</span><span class="org-comment-delimiter"> *)</span>
mySet = TreeSet.empty;
</pre>
</div>
</div>
</div>
<div id="outline-container-h-b1168d9b-0e58-41f4-9bcc-53e5d2775d08" class="outline-2">
<h2 id="h-b1168d9b-0e58-41f4-9bcc-53e5d2775d08"><span class="section-number-2">2.</span> Datatypes in Signatures</h2>
<div class="outline-text-2" id="text-h-b1168d9b-0e58-41f4-9bcc-53e5d2775d08">
<p>
One caveat worth discussing: we can end up with duplicate-but-distinct types 
if we place datatype declarations in signatures. For example, consider
the signature:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">signature</span> <span class="org-interface-def">EXP</span> = <span class="org-keyword">sig</span>
    <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = Var <span class="org-keyword">of</span> id
               | Abs <span class="org-keyword">of</span> id * t
               | App <span class="org-keyword">of</span> t * t
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
Suppose we have two different structures which implement this signature,
e.g., one for a parse tree and another for an abstract syntax tree:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">structure</span> <span class="org-module-def">ParseTree</span> : EXP = <span class="org-keyword">struct</span>
    <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = Var <span class="org-keyword">of</span> id
               | Abs <span class="org-keyword">of</span> id * t
               | App <span class="org-keyword">of</span> t * t;
<span class="org-keyword">end</span>;

<span class="org-keyword">structure</span> <span class="org-module-def">AST</span> : EXP = <span class="org-keyword">struct</span>
    <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = Var <span class="org-keyword">of</span> id
               | Abs <span class="org-keyword">of</span> id * t
               | App <span class="org-keyword">of</span> t * t;
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
The surprise: <code>AST.t</code> and <code>ParseTree.t</code> are two distinct types.
This is because Standard ML has generative datatype declarations,
meaning: each time a <code>datatype</code> declaration is encountered, a new type
will be created. We could avoid this by doing something like:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">struct</span> Exp = <span class="org-keyword">struct</span>
    <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = Var <span class="org-keyword">of</span> id
               | Abs <span class="org-keyword">of</span> id * t
               | App <span class="org-keyword">of</span> t * t;
<span class="org-keyword">end</span>;
       
<span class="org-keyword">signature</span> <span class="org-interface-def">EXP</span> = <span class="org-keyword">sig</span>
    <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = <span class="org-keyword">datatype</span> <span class="org-type-def">Exp.t</span>;
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
This is specified by rule 18 of the 1997 definition of SML to not
generate duplicate datatypes. We could also do the following:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">datatype</span> <span class="org-type-def">Exp</span> = Var <span class="org-keyword">of</span> id
             | Abs <span class="org-keyword">of</span> id * Exp
             | App <span class="org-keyword">of</span> Exp * Exp;

<span class="org-keyword">signature</span> <span class="org-interface-def">EXP</span> = <span class="org-keyword">sig</span>
    <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = <span class="org-keyword">datatype</span> <span class="org-type-def">Exp</span>;
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
But it is unclear if we could do the following:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">local</span>
    <span class="org-keyword">datatype</span> <span class="org-type-def">Exp</span> = Var <span class="org-keyword">of</span> id
                 | Abs <span class="org-keyword">of</span> id * Exp
                 | App <span class="org-keyword">of</span> Exp * Exp;
<span class="org-keyword">in</span>
    <span class="org-keyword">signature</span> <span class="org-interface-def">EXP</span> = <span class="org-keyword">sig</span>
        <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = <span class="org-keyword">datatype</span> <span class="org-type-def">Exp</span>;
    <span class="org-keyword">end</span>;
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
This also has the problem/feature that the constructors <code>Var</code>, <code>Abs</code>,
<code>App</code> are private.
</p>

<p>
(This is also probably why signatures should have just <code>type t</code> instead
of a datatype declaration.)
</p>

<p>
See:
</p>
<ul class="org-ul">
<li><a href="http://mlton.org/GenerativeDatatype">Generative Datatypes</a> in MLton's wiki</li>
<li><a href="http://mlton.org/TipsForWritingConciseSML">Tips for writing concise SML</a> in MLton's wiki</li>
<li>Appendix G &sect;&sect;2&#x2013;3 of the <a href="https://smlfamily.github.io/sml97-defn.pdf">Revised Definition of Standard ML</a>.</li>
<li>&sect;4.3.3 of "The History of Standard ML"</li>
<li>Karl Crary, Robert Harper, Perry Cheng, Leaf Petersen, Chris Stone,
<a href="https://www.seas.upenn.edu/~sweirich/types/archive/1999-2003/msg00053.html">Transparent and opaque interpretations of datatypes</a> (1998).</li>
</ul>
</div>
</div>
<div id="outline-container-h-5e1f48c1-d6ff-4e40-bcc4-08564a1aa48d" class="outline-2">
<h2 id="h-5e1f48c1-d6ff-4e40-bcc4-08564a1aa48d"><span class="section-number-2">3.</span> Stringify Types</h2>
<div class="outline-text-2" id="text-h-5e1f48c1-d6ff-4e40-bcc4-08564a1aa48d">
<p>
In Haskell, we tend to have a single typeclass <a href="https://hackage.haskell.org/package/base-4.17.0.0/docs/Text-Show.html"><code>Show</code></a> which has a "to string"
method. Standard ML does not have anything similar to type classes, so
we end up encoding them as signatures. Strictly speaking, we would have
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">signature</span> <span class="org-interface-def">SHOW</span> =
<span class="org-keyword">sig</span>
    <span class="org-keyword">type</span> <span class="org-type-def">t</span>;
    <span class="org-keyword">val</span> <span class="org-variable-name">toString</span> : t -&gt; string;
<span class="org-keyword">end</span>;
</pre>
</div>
</div>
<div id="outline-container-h-889254de-0316-4e44-9331-d92d371b8419" class="outline-3">
<h3 id="h-889254de-0316-4e44-9331-d92d371b8419"><span class="section-number-3">3.1.</span> Type Conversions</h3>
<div class="outline-text-3" id="text-h-889254de-0316-4e44-9331-d92d371b8419">
<p>
More broadly, if we have defined two types <code>A</code> and <code>B</code>, and it is
"obvious" we can convert any value of type <code>A</code> to a value of type <code>B</code>,
then we define a function of the form:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">structure</span> <span class="org-module-def">A</span> =
<span class="org-keyword">struct</span>
    <span class="org-keyword">type</span> <span class="org-type-def">t</span>;
    <span class="org-keyword">val</span> <span class="org-variable-name">toB</span> : t -&gt; B;
    <span class="org-comment-delimiter">(* </span><span class="org-comment">val fromB : B -&gt; t; if we can convert the other way aro</span><span class="org-comment"><span class="org-highlight-beyond-fill-column">und</span></span><span class="org-comment-delimiter"><span class="org-highlight-beyond-fill-column"> *)</span></span>
    <span class="org-comment-delimiter">(* </span><span class="org-comment">etc.</span><span class="org-comment-delimiter"> *)</span>
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
Then we have <code>A.toB foo</code> be an "obvious" conversion.
</p>

<ul class="org-ul">
<li>Gansner and Reppy's <i>Standard ML Basis Library</i>, section 1.1.4,
encourages this sort of naming convention for conversion functions.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-770611ec-d37f-42e9-9e97-802a79d389be" class="outline-2">
<h2 id="h-770611ec-d37f-42e9-9e97-802a79d389be"><span class="section-number-2">4.</span> Comparable Types</h2>
<div class="outline-text-2" id="text-h-770611ec-d37f-42e9-9e97-802a79d389be">
<p>
When defining a new type <code>T</code>, we would need to implement a function
<code>compare : T * T -&gt;</code> <a href="https://smlfamily.github.io/Basis/general.html#SIG:GENERAL.order:TY"><code>order</code></a>.
This should be placed in a signature, so it's "public facing".
</p>

<p>
We would want various nice properties of the ordering, like:
</p>

<ul class="org-ul">
<li>Transitivity: if <code>compare(x,y) = compare(y,z)</code>, then we want
<code>compare(x,z) = compare(x,y)</code> too.</li>
<li>Reflexivity: for any <code>x</code>, we want <code>compare(x, x) = EQUAL</code></li>
<li>Antisymmetry: if <code>not (compare(x, y) = GREATER)</code> and
<code>not (compare(y, x) = GREATER)</code>, then we expect <code>compare(x, y) = EQUAL</code>.</li>
</ul>

<p>
A "nice to have" property which, I am not certain is absolutely necessary:
</p>

<ul class="org-ul">
<li>Completeness: for any <code>x</code> and <code>y</code>, we want <code>compare(x,y) orelse compare(y,x)</code>
to be true</li>
</ul>

<p>
Examples:
</p>

<ul class="org-ul">
<li><a href="weight-balanced-tree.html#h-96e60562-fa51-44fd-b2c2-1808d0d7cc2b">Discussion with Weight-Balanced Trees</a></li>
</ul>

<p>
References:
</p>

<ul class="org-ul">
<li>Gansner and Reppy's <i>Standard ML Basis Library</i>, sections 1.1.3 and 4.1,
encourages this sort of practice with linear orders.</li>
</ul>
</div>
<div id="outline-container-h-bb3e2d02-6651-49d4-82bb-11083bfa0fb5" class="outline-3">
<h3 id="h-bb3e2d02-6651-49d4-82bb-11083bfa0fb5"><span class="section-number-3">4.1.</span> Caveat: Equality Testing</h3>
<div class="outline-text-3" id="text-h-bb3e2d02-6651-49d4-82bb-11083bfa0fb5">
<p>
The only caveat which springs to mind is that it may be faster to
implement your own function testing for equality. Again, Haskell has
<a href="https://hackage.haskell.org/package/base-4.17.0.0/docs/Data-Eq.html"><code>Data.Eq</code></a> typeclass, but Standard ML has equality type kludge.
</p>

<p>
For example, if you are implementing a proof assistant, and you have a
datatype encoding logical propositions, it would be somewhat faster to
implement your own <code>eq</code> function than to use <code>compare (x,y) = EQUALS</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-h-20417263-b75c-464c-b4ef-e48078110bd6" class="outline-2">
<h2 id="h-20417263-b75c-464c-b4ef-e48078110bd6"><span class="section-number-2">5.</span> Principle: Similar Functions should have Similar Names</h2>
<div class="outline-text-2" id="text-h-20417263-b75c-464c-b4ef-e48078110bd6">
<p>
If we are building our own collection data structure (say, a set or
hashmap or whatever), then we should name the functions similar to
analogous functions on lists. For example,
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">signature</span> <span class="org-interface-def">SET</span> =
<span class="org-keyword">sig</span>
    <span class="org-keyword">type</span> 'a <span class="org-type-def">t</span>;
    <span class="org-keyword">val</span> <span class="org-variable-name">app</span> : ('a -&gt; unit) -&gt; 'a t -&gt; unit;
    <span class="org-keyword">val</span> <span class="org-variable-name">map</span> : ('a -&gt; 'b) -&gt; 'a t -&gt; 'b t;
    <span class="org-comment-delimiter">(* </span><span class="org-comment">And so on...</span><span class="org-comment-delimiter"> *)</span>
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
The intuition being that an instance of <code>SET.t</code> is like a list and
should have analogous <a href="https://smlfamily.github.io/Basis/list.html#SIG:LIST.map:VAL"><code>map</code></a> and <a href="https://smlfamily.github.io/Basis/list.html#SIG:LIST.app:VAL"><code>app</code></a> functions (among others). In
retrospect, a better design choice would have been to have a hierarchy
of signatures for collections, and the structure would implement the
relevant one.
</p>

<ul class="org-ul">
<li>Gansner and Reppy's <i>Standard ML Basis Library</i>, section 1.1.2,
encourages this sort of practice.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Tue, 21 Feb 2023 09:26:05 -0800
</div>
</body>
</html>
